ProgessBase/DataProcessors/АП_ПечатьСопроводительныхДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<DataProcessor>
		<Properties>
			<Name>АП_ПечатьСопроводительныхДокументов</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоОграничений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПостроительОтчета</Name>
					<Type>
						<v8:Type>cfg:ReportBuilder</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФормированияДокументов</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьПоРейсам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтборВключен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПРГ_ИспользоватьВыборПринтера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПечатныеФормы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПечатнаяФорма</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.АП_ПечатныеФормыДокументов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредварительныйПросмотр</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СформированныеДокументы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Пометка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Накладная</Name>
							<Type>
								<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаданиеНаПодбор</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.СП_ЗаданиеНаПодбор</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Маршрут</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПТЛ_Маршруты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Водитель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПТЛ_Водители</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТранспортноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПТЛ_ТранспортныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Рейс</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПТЛ_Рейсы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОшибкаПечати</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПометкаУдаления</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокПроведен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

ProgessBase/AccumulationRegisters/ПТЛ_ПланДоставки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<AccumulationRegister>
		<Properties>
			<Name>ПТЛ_ПланДоставки</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Вес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВесБрутто</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПаллетоМест</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПозиций</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтоимостьПоЗаданиям</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПТЛ_Маршруты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетОтгрузки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяПодачиТС</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТЭК</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Водитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПТЛ_Водители</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПТЛ_ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаДоставки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коментарий</Name>
					<Comment>Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>900</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТранспорта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПТЛ_ТипыТранспортныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Самовывоз</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Отделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НСИ_Отделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ДатаОтгрузки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Рейс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПТЛ_Рейсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаданиеНаПеревозку</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПТЛ_ЗаданиеНаПеревозку</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПланДоставки</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПТЛ_ПланДоставки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЗаданиеНаПодбор</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.СП_ЗаданиеНаПодбор</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исключено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

ProgessBase/DataProcessors/АП_ПечатьСопроводительныхДокументов/Ext/ObjectModule.bsl
Перем мОткрытаИзДокумента Экспорт;
Перем мЗаданиеНаПодбор Экспорт;

Процедура ИнициализируемПостроительОтчета() Экспорт

	ПостроительОтчета.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	                          |	ПТЛ_ПланДоставки.Маршрут КАК Маршрут,
	                          |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор.Получатель КАК Получатель,
	                          |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор.СтатусДокумента КАК СтатусДокумента,
							  //начало изменений Ожиганов 21.05.2015 работа фильтров 
							  |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор как ЗаданиеНаПодбор,
							  //конец изменений 
/// Кунов О.В., 24.03.2015 - 37873
	                          |	ПТЛ_ПланДоставки.Водитель,
	                          |	ПТЛ_ПланДоставки.ТранспортноеСредство,
	                          |	ПТЛ_ПланДоставки.ТЭК
///							  
	                          |{ВЫБРАТЬ
	                          |	Маршрут.* КАК Маршрут,
	                          |	Получатель.*,
	                          |	СтатусДокумента.*,
/// Кунов О.В., 24.03.2015 - 37873							  
	                          |	Водитель.*,
	                          |	ТранспортноеСредство.*,
	                          |	ТЭК.*}
///							  
	                          |ИЗ
	                          |	РегистрНакопления.ПТЛ_ПланДоставки КАК ПТЛ_ПланДоставки
	                          |ГДЕ
	                          |	ПТЛ_ПланДоставки.Отделение = &Отделение
	                          |	И ПТЛ_ПланДоставки.ДатаОтгрузки = &ДатаОтгрузки
	                          |	И ПТЛ_ПланДоставки.Исключено = ЛОЖЬ
	                          |{ГДЕ
	                          |	ПТЛ_ПланДоставки.Маршрут.*,
	                          |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор.Получатель.* КАК Получатель,
	                          |	ПТЛ_ПланДоставки.ЗаданиеНаПодбор.СтатусДокумента.* КАК СтатусДокумента,
/// Кунов О.В., 24.03.2015 - 37873							  
	                          |	ПТЛ_ПланДоставки.Водитель.*,
	                          |	ПТЛ_ПланДоставки.ТранспортноеСредство.*,
	                          |	ПТЛ_ПланДоставки.ТЭК.*}";
///							  
							  
	/// Кунов О.В., 24.03.2015 - 37873
	ДобавитьОтбор("Маршрут");
	ДобавитьОтбор("Получатель");
	ДобавитьОтбор("СтатусДокумента");
	ДобавитьОтбор("Водитель");
	ДобавитьОтбор("ТранспортноеСредство");
	ДобавитьОтбор("ТЭК");
	///						  
							  
	мУниверсальныйОтчет = Отчеты.УниверсальныйОтчет.Создать();
	мУниверсальныйОтчет.ПостроительОтчета = ПостроительОтчета;
	
	СтруктураПредставлениеПолей = Новый Структура;
	СтруктураПредставлениеПолей.Вставить("Маршрут", "Маршрут");
	СтруктураПредставлениеПолей.Вставить("Получатель", "Получатель");
	СтруктураПредставлениеПолей.Вставить("СтатусДокумента", "Статус документа");
	СтруктураПредставлениеПолей.Вставить("Водитель", "Водитель");
	СтруктураПредставлениеПолей.Вставить("ТранспортноеСредство", "ТранспортноеСредство");
	СтруктураПредставлениеПолей.Вставить("ТЭК", "ТЭК");
	
	мУниверсальныйОтчет.УстановитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);

КонецПроцедуры


/// Кунов О.В., 24.03.2015 - 37873
Процедура ДобавитьОтбор(Поле)
	
	Если ПостроительОтчета.Отбор.Найти(Поле) = Неопределено Тогда
		
		ПостроительОтчета.Отбор.Добавить(Поле);
		
	КонецЕсли; 	
	
КонецПроцедуры
///


мОткрытаИзДокумента = Ложь;
мЗаданиеНаПодбор = Документы.СП_ЗаданиеНаПодбор.ПустаяСсылка();
